In [58]:
import pandas as pd
data= pd.DataFrame({
    'Age': [25, 23, 40, 30],
    'salary': [35000, 45000, 90000, 60000],
    'Experience': [3, 5, 10, 7]
})
data = pd.DataFrame(data)
data

   Age  salary  Experience
0   25   35000           3
1   23   45000           5
2   40   90000          10
3   30   60000           7

In [60]:
from sklearn.preprocessing import MinMaxScaler
scaler = MinMaxScaler()

data_minmax = pd.DataFrame(
    scaler.fit_transform(data),
    columns=data.columns
)
data_minmax

        Age    salary  Experience
0  0.117647  0.000000    0.000000
1  0.000000  0.181818    0.285714
2  1.000000  1.000000    1.000000
3  0.411765  0.454545    0.571429

In [62]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()

df_standard = pd.DataFrame(
    scaler.fit_transform(data),
    columns=data.columns
)
df_standard

        Age    salary  Experience
0 -0.684257 -1.083473   -1.256757
1 -0.988372 -0.601929   -0.483368
2  1.596600  1.565016    1.450105
3  0.076029  0.120386    0.290021

In [64]:
from sklearn.preprocessing import RobustScaler

scaler = RobustScaler()

df_robust = pd.DataFrame(
    scaler.fit_transform(data),
    columns=data.columns
)
df_robust

      Age  salary  Experience
0 -0.3125    -0.7   -0.923077
1 -0.5625    -0.3   -0.307692
2  1.5625     1.5    1.230769
3  0.3125     0.3    0.307692

In [66]:
from sklearn.preprocessing import MaxAbsScaler

scaler = MaxAbsScaler()

df_maxabs = pd.DataFrame(
    scaler.fit_transform(data),
    columns=data.columns
)
df_maxabs

     Age    salary  Experience
0  0.625  0.388889         0.3
1  0.575  0.500000         0.5
2  1.000  1.000000         1.0
3  0.750  0.666667         0.7